Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: So that's actually how neurons are able to make that tradeoff between traveling huge distances, but not losing their signal.
ht: Se poutèt sa se aktyèlman jan neurones pou n ka fè sa: ant vwayaje distans yon gwo, men, pa pèdi siyal yo.

source: All right, problem 79. What is the domain of the function shown on the graph below? That sounds like fancy word.
ht: Ki domaine de funktion ki nan pwoblem nan nan graf lan se yon non ke yo bay pwoblem nan yon funktion se yon regle se yon regle ki soti nan yon group ale nan yon lot group nimero ale nan yon lot de moun a yon lòt.

source: And the set of numbers that it maps from is the domain.
ht: Et la ansanm nonm sa li cartes de se domèn a.

source: And the set of numbers that it maps to is the range.
ht: Et la ansanm nonm sa li kat jewografi yo pou se la gamme.

source: So if this is the set of numbers of the domain, this is set of numbers of the range, the function tells us how do we get from this number, some place in domain, to that number, some place in the range.
ht: Si sa se ansanm Des numéros de domèn a, sa se ansanm nonm de la Plage, fonksyon a di nou ki jan fè nou pran nan nimewo sa a, yon kote nan domèn, pou sa nombre, kèk kote nan limit la.

source: So in general, the domain is all the numbers for which this mapping, or this function, is defined.
ht: An jeneral, domèn a se tout moun pou ki sa transfòmasyon, ou fonksyon sa a, defini. Lese dakò, se konsa nou wè, se konsa domèn a se kote sa sa ye fonksyon jan l defini?

source: And in general, when you plot it on the xy-axis, the domain is all of the x values that you're defined over and the range is all the y values.
ht: Et an jeneral, lè ou tracé li sou a xy-aks, sa te fè domèn a Se tout dè valè x ou ap jan l defini sou Et la Se tout l' y valè.

source: So the function is a mapping from x to y.
ht: Se konsa fonksyon a se yon transfòmasyon de x pou y.

source: So let's see where it's defined when x is equal to 4.
ht: Se konsa an n wè kote l' te defini lè x egal a 4.

source: It tells us we're mapping from x is equal to 4 to y is equal to negative 1.
ht: Li di nou nou ap correspondance de x se bon pou 4 pou y egal-ego pou negatif 1.

source: So it's defined for x is equal to 4, for x is equal to 5, for x is equal to 2, and it's defined for x is equal to 1.
ht: Se konsa, li defini x se egal a 4, paske x 5, egal-ego pou x egal a 2, e li defini x se egal a 1.

source: So it's defined for all of those numbers.
ht: Se konsa li defini pou tout kantite moun.

source: That's the domain.
ht: Sa se domèn a.

source: This function is not defined.
ht: Fonksyon sa a pa defini.

source: We don't know what happens when x is equal to minus 2.
ht: Nou pa konnen kisa ki rive lè x egal a moins 2.

source: It's not defined.
ht: Li pa defini.

source: It doesn't tell us what y equals here.
ht: Li pa di nou à y ki isit la.

source: So these are the only numbers for which this function is defined.
ht: Se poutèt sa yo anpil sèl moun ki fonksyon sa a jan l defini.

source: It tells us that 4 maps to negative 1, that 5 maps to negative 2, that 2 maps to minus 5, and that 1 maps to minus 4.
ht: Li di nou 4 cartes pou négatif 1, 5 cartes pou negatif 2, sa 2 cartes pou moins 5, Et 1 sa cartes pou moins 4.

source: That's all it tells us.
ht: Sa se tou sa l' di nou.

source: And this is actually the range.
ht: Et sa se aktyèlman la gamme. E se pou sa a domèn.

source: So let's see, 4, 5, 2, 1.
ht: Se konsa nou wè, 4, 5, 2, 1.

source: This is the domain.
ht: Sa a se domèn a.

source: That's the set of all numbers for which this function is defined.
ht: Sa se a ansanm tout nonm ki fonksyon sa a jan l defini.

source: This minus 1, 2, 5, and 4.
ht: Sa moins 1, 2, 5 Et 4.

source: This is the range right here.
ht: Sa se ranje a droit isit la.

source: Choice B is the range. All right.
ht: B choix se la gamme. oke.

source: I think we're on the last problem.
ht: Mwen kwè nou sou pwoblèm dènye a.

source: This is going to be a lot of cutting and pasting.
ht: Sa pwal yon lòt de Coupe Et.

source: I don't know if it's going to fit.
ht: M pa konn si li ap anfòm.

source: I have to shrink it.
ht: Mwen gen pou vini pi piti li.

source: OK, they say which of the following is not a function?
ht: Dakò, yo di ki moun sa a se pa yon fonksyon?

source: That's fascinating.
ht: Sa fascinante.

source: OK, I copied it.
ht: Dakò, mwen copié li.

source: And now I have pasted it.
ht: Et, koulye a mwen te coller li.

source: And it did all barely fit on this page.
ht: Apre sa, li te fè tout à s' nan paj sa a.

source: So which is not a function?
ht: Se poutèt sa se pa yon fonksyon?

source: And remember, what I said in the beginning.
ht: Et, li pa bliye sa m te di depi nan konmansman an.

source: I don't have space below here.
ht: M pa gen plas pi ba pase isit la.

source: Let's think about what a function is and then we could look at the graph.
ht: An n panse osijè de yon fonksyon ki se Et lè sa a nou te kapab gade graf a.

source: So a function is a mapping from one set to another.
ht: Se konsa yon fonksyon se yon transfòmasyon de ansanm yonn pou lòt.

source: From set A to set B.
ht: De ansanm, UN ete b

source: Where A is the domain and B is the range.
ht: Ki kote UN se domèn a Et B se la gamme.

source: And this is important thing to realize about a function.
ht: Et, sa se bagay enpòtan pou reyalize sou yon fonksyon.

source: So if this is set A, and if this is set B, that for any value in set A, it only maps to one value in set B.
ht: Se konsa si sa a tabli UN, Et si sa a tabli B, sa pou tout valè nan ansanm nonm UN, li sèlman cartes pou yon valè nan définir b

source: You cannot have this.
ht: Ou pa kapab fè sa.

source: You can't have one value in set A going to this value and going to another value.
ht: Ou pa kapab fè yon valè nan tabli yon pwal valè sa a Et pwal pou valè yon lòt.

source: So that would not make it a function.
ht: Se konsa sa pa fè l' yon fonksyon.

source: If we say x is the domain, if this is the set of all values we can put into x, and this all the set of values that can go into y or that can be y, then one value of x can't produce two values of y.
ht: Si nou di x se domèn a, si se sa rele a etabli dè valè tout nou kapab mete nan x, Et sa a tout a etabli dè valè ki kapab y ale ou ki kapab y, puis yon valè x ne pwodwi de valè de y.

source: You can have it the other way around.
ht: Ou ka gen l' lòt bò nan.

source: You could have two different values of x producing the same value of y.
ht: Ou te kapab gen de diferan objektif de x pwodwi menm bagay la tou valè y.

source: And we'll think about what that is.
ht: E nou ap panse osijè de sa ki se.

source: That's completely valid.
ht: Sa bon nèt.

source: You could have two numbers.
ht: Ou te kapab gen anpil de moun.

source: When x is equal to 2 and x is equal to 7, you can still have y equaling the same thing.
ht: Lè sa a, x egal a 2 Et x egal a 7, ou ka toujou gen y equaling menm bagay.

source: Say this is x is equal to 5.
ht: Di sa se x 5 egal-ego.

source: X is equal to 5 could be y is equal to 7.
ht: X egal a 5 peut être y egal a 7.

source: Or x is equal to 5 could be y is equal to 8.
ht: Ou x egal a 5 peut être y egal a 8.

source: We don't know that.
ht: Nou pa konnen sa.

source: So let's see.
ht: Se konsa lese nou wè.

source: Let's think about how we can visually think about this.
ht: An n panse osijè de kòman nou kapab visuellement panse osijè de sa.

source: For every value of x, we only have one definition for y.
ht: Pou chak valè x, nou sèlman gen yon definisyon pou y.

source: And people often call that the vertical line test.
ht: Ak moun ki konn rele sa a tès liy vètikal.

source: At no point on this graph can I draw a vertical line and it intersects it twice.
ht: Nan non pwent (n) sou graf sa a ka mwen trase yon liy vètikal Et sa avec l' de fwa.

source: If a vertical intersects it twice, that means for a given value of x, this function defines two different y's.
ht: Si yon vètikal avec l' de fwa, sa vle di pou yon bay valè x, fonksyon sa a définit y's diferan de

source: Not going to happen.
ht: Pa pwal pase.

source: Now this function does for any given y have two different x's.
ht: Koulye a fonksyon sa a pou tout bay y ont x's diferan de

source: Like that point and that point.
ht: Tankou pwen sa yo ak pwen sa yo.

source: That's OK.
ht: Sa se pa pi mal.

source: That's completely fine.
ht: Sa bon nèt.

source: So for example, when x is equal to minus 1.5 and x is equal to 3, they point to the same number.
ht: Se konsa pa egzanp, lè x ki egal a moins 1.5 Et x se egal-ego pou 3, yo montre menm nonb. Sa se complètement pa pi mal.

source: As long as one of these doesn't point to two separate numbers.
ht: Osi lontan ke bèt sa yo pa montre m de numéros distinct.

source: So that magenta is what that first graph is doing.
ht: Lè sa a, magenta se sa graf premye sa ap fè.

source: Same thing here, for any given y we can have two x's pointing to it.
ht: Menm bagay la, pou bay y tout nou kapab genyen de x's t' ap li.

source: And they're just fine.
ht: Et, yo gen sèlman byen.

source: That's completely fine for a function.
ht: Sa bon nèt pou yon fonksyon.

source: Now, we talk about function inverses, well I don't want to get too complicated.
ht: Koulye a, nou pale osijè fonksyon inverses, men mwen pa vle pou yo pran tou konplike.

source: If we do the vertical line test, at no point can we draw vertical line and get, for any given x, two separate y's.
ht: Si nou fè tès liy vètikal lan, nan okenn ka nou trase liy vètikal Et obtenir, pou bay tout x, de mitan y's

source: Same thing for here.
ht: Menm bagay pou isit la.

source: Actually here, we have a complete 1:1 mapping.
ht: Aktyèlman isit la, nou gen yon nèt sou tout pwen transfòmasyon 1: 1.

source: For any given x, there's one y.
ht: Pou bay tout x, pa gen yon sèl y.

source: I think here it should be clear, that if I were to draw vertical line, let's say right there, for x is equal to 1, it has two definitions.
ht: Mwen panse ke isit la li ta dwe klè, si m' to ran vètikal liy, an n ap di la a, paske x 1, egal-ego li gen de définitions.

source: Even better, for x is equal to 0, y could be minus 2 or plus 2.
ht: Jan ki bon, paske x rive fè 0, y peut être moins 2 ou plus 2.

source: So that's the case that we said.
ht: Se poutèt sa se ka sa nou te di.

source: For x is equal to 0, it's pointing to plus 2 and it's pointing to minus 2.
ht: Paske x rive fè 0, li vers pou plus 2 Et se t' ap moins 2.

source: It's pointing to two different values which you cannot have in a function.
ht: Li t' ap de diferan objektif sa ou pa kapab fè nan yon fonksyon.

source: For a function, for any given x, you can only define one y value.
ht: Pou yon fonksyon, pou bay tout x, ou kapab sèlman defini yon valè y.

source: So this relation is not a function.
ht: Se konsa nonm sa a se pa yon fonksyon.

source: Next question.
ht: Kesyon kap vini.

source: I think this is the last.
ht: Mwen kwè ke sa a se dènye a.

source: It's a page on its own.
ht: Li se yon paj sou pwòp.

source: Oh, that was the last question.
ht: O, ki te dènye kesyon an genyen.

source: Did I skip a problem?
ht: A mwen pase sou yon pwoblèm?

source: See that was 80.
ht: Gade sa yo ki te 80.

source: That's it.
ht: Sa se li.

source: We're all done.
ht: Nou gen tout fè.

source: All right, see you soon.
ht: Byen, na wè Talè.

source: In this video we're going to talk about the French, the French Revolution.
ht: Nan videyo sa a nou pwal pale osijè de Fwansè, Fwansè revolisyon an.

source: And what makes this especially significant is that not only is this independence from a monarchy-controlled empire, like in the American Independence, this is an actual overthrowing of a monarchy, of a monarchy that controls a major world power.
ht: Kisa ki konn sa espesyalman importante se sa se pa sèlman endepandans sa a nan yon monarchie ki te kontwole anpi, tankou nan Ameriken endepandans la, sa se yon réel ranvèse de yon monarchie, de yon monarchie ki te kontwole yon pi gwo pisans mondyal.

source: So this is, on some level, depending on how you view it...
ht: Se poutèt sa se, sou nivo kèk, selon jan ou wè l...

source: The American Revolution came first and kind of put out the principles of self-governance and why do we need kings and all of that.
ht: Revolisyon amerikèn lan a ki soti anvan ti jan tenyen pwensip yo de Gouvènans ak pwòp tèt ou Et, poukisa èske nou bezwen wa yo ak tout moun sa.

source: But the French Revolution was the first time that those type of principles really took foot in Europe and really overthrew a monarchy.
ht: Men, revolisyon Fwansè a, ki te pou premye fwa sa moun gwoup de principes vrèman pran pye nan Ewòp Et antrène vrèman yon monarchie.

source: So just to understand kind of the environment in which this began: let's talk about what France was like in 1789, which most people kind of view as the beginning of the Revolution.
ht: Sa sèlman pou konprann jan de anviwònman nan ki sa a: an n pale osijè sa frans te tankou nan lane 1789, ki pi fò moun jan de vi kòm kòmansman revolisyon an.

source: One, France was poor.
ht: UN, frans te pòv.

source: France-was-poor.
ht: Lafwans-li te genyen-pòv.

source: Now, you wouldn't think that France was poor if you looked at Louis XVl, who was King of France,
ht: Koulye a, ou pa panse ke frans te pòv Si ou gade Louis XVI, ki te wa peyi Lafwans,

source: If you looked at Louis XVI and the clothes he wore.
ht: Si ou gade sou Louis XVI, li te mete rad yo.

source: If you looked at Marie-Antoinette, his wife, they don't look poor.
ht: Si ou gade Marie-Antoinette, madanm li, yo pa gade pòv.

source: They lived in the palace of Versailles which is ginormous.
ht: Yo te rete nan palè Versailles ki se ginormous.

source: It's this massive palace, it would compare to the greatest palaces in the world.
ht: Li se masiv palè sa a, li ta konpare pou palais pi gwo nan mond lan.

source: They were living a lavish lifestyle.
ht: Yo te rete yon resevwa lwanj vie.

source: Just in case you want to know where this is, this is what's now almost a suburb of Paris.
ht: Tout nan ka ou vle konnen kote sa ye, sa a se sa koulye a se pwèske yon banlieue de Paris.

source: But at the time it was a village 20 or 30 kilometers away from Paris.
ht: Men, nan moman an, se te yon vil 20 ou 30 kilomèt kite Paris.

source: So they don't seem to be poor.
ht: Se konsa, yo pa wè pòv.

source: But the actual government of France is poor.
ht: Men gouvènman aktyèl la Auguste, pòv.

source: And when I say poor, they're in debt.
ht: Apre sa, lè m' di pòv, yo ap dwe.

source: They've just had two major military adventures.
ht: Yo te gen sèlman de gwo aventures militè.

source: One was the American Revolution.
ht: Youn te revolisyon amerikèn lan.

source: They played a major part in supporting the revolutionaries.
ht: Yo te jwe yon gwo pati nan en poutèt sa inite revolisyonè pa yo.

source: Because they wanted to stick it to their enemy:
ht: Paske yo te vle pou m kole l pou lènmi yo!

source: Great Britain.
ht: Grann Bretay.

source: They wanted their empire to shrink a little bit.
ht: Yo te vle yo anpi pou vini yon ti jan pi piti.

source: So France sent significant military help and resources.
ht: Se konsa, Fwans te voye gwo èd militè ak resous.

source: And you could imagine, that's not a cheap thing when you're doing it across the Atlantic Ocean.
ht: Apre sa, ou te kapab kwè, se pa yon bagay ki pa chè Lè w ap fè l' travèse Oseyan Atlantik la.

source: And, even before the American Revolution, the Seven Years' War that ended in 1763, this really drained the amount of wealth that the French government had.
ht: Et, menm devan revolisyon amerikèn lan, Lagè sèt lanne yo ki te fini an 1763, sa vrèman vide an kantite lajan sa pa gouvènman Fransè a a.

source: And for those of you who are more American history focused, the Seven Years' War is really the same thing as the French and Indian War.
ht: Ki moun ye istwa ki rale plis Ameriken ki atire atansyon, se pou nou Lagè sèt lanne yo se vrèman menm bagay kòm Fwansè ak Endyen lagè a.

source: The French and Indian War was the North American theater of the Seven Years' War.
ht: Sòlda Fwansè ak Endyen te genyen nan Nò Ameriken teyat sèt lanne yo vanyan sòlda.

source: But the Seven Years' War is the more general term.
ht: Men goumen sèt lanne yo, se plis jeneral manda a.

source: Because there was also a conflict going on in Europe simultaneously.
ht: Paske te gen tou yon konfli ki kap pase nan Ewòp simultanément.

source: The French and Indian War was just part of that conflict.
ht: Fransè a n' a lagè Endyen jis pati de konfli sa.

source: And the Seven Years' actually engulfed most of the powers of Europe at the time.
ht: Ak sèt lanne yo aktyèlman a pi fò nan pouvwa an Ewop yo nan moman an.

source: So France had participated in this, ended in 1763, you had the American Revolution.
ht: Se konsa, Fwans te patisipe nan sa, te fini an 1763, ou pa gen revolisyon amerikèn lan.

source: Both of these really just drained the amount of funds that the government itself had.
ht: Tou le de sa yo te vwèman inikman vide an kantite lajan ki disponib ke gouvènman an tèt li a.

source: At the same time, the French people were starving.
ht: An menm tan an, Fwansè yo te grangou ap.

source: So people: people starving.
ht: Se konsa moun: moun kap mouri ak grangou.

source: There was a generalized famine at the time.
ht: Te gen yon grangou jeneralize nan moman an.

source: They weren't producing enough grain, people couldn't get their bread to eat.
ht: Yo pa te pwodwi rekòt ase, moun pa t kapab jwenn pen pou yo manje pou manje.

source: So you can imagine, when people are starving they're not happy.
ht: Se konsa ou ka konprann, Lè moun ki grangou ap ke yo pa bon.

source: And to kind of add insult to injury you would see your royals living like this.
ht: Et pou jan de ajouter ensilt pou blesi (n) ou ta wè ou royals pou yo viv tankou sa a.

source: But even worse than the royals, who you don't see every day, you saw your nobility.
ht: Men, pi mal pase royals yo, moun ou pa wè chak jou, nou te wè ou rich.

source: Who is roughly a little over 1.5% of the population.
ht: Yo ki se yon ti kras pase 1.5% nan popilasyon an.

source: But you saw the nobility really, really, living it up.
ht: Men, nou te wè rich reyèlman, reyèlman, rete il leve.

source: And the nobility, just so you know, these are people with fancy titles who inherit land and wealth from generation to generation.
ht: Et rich, sèlman pou nou konnen. se moun ak titres fantaisie ki te eritye peyi ak richès de pitit an pitit.

source: They don't dress too differently from the King.
ht: Yo pa panse tou yon lòt jan wa a.

source: And they essentially live in smaller versions of the Palace of Versailles.
ht: Apre sa, yo esansyèlman rete nan vèsyon plus de palè Versailles.

source: And if you're a peasant, you work on their fields, do all the work, you send them some of your crops and they pay no taxes.
ht: Et si ou gen yon peyizan, w ap travay nan jaden yo. fè tout travay la, ou voye yo kèk nan rekòt nou yo Apre sa, yo peye taks pa.

source: So from your point of view, and it's not hard to understand why you would think this, these are essentially kind of parasites who are completely ignoring the fact that you are starving and you're paying all the taxes.
ht: Sa ou pwen de vi, de e li pat difisil pou konprann Poukisa ou ta panse sa a, sa esansyèlman type de parazit ki sont complètement en Lefèt ke nou ap grangou ap Et n' ap peye tout taks yo.

source: You can imagine people weren't too happy about that.
ht: Ou ka konprann moun pa te twò kontan sou sa.

source: And then to top it all off, you had all of these philosophers hanging around, talking about the Enlightenment.
ht: Et puis wotè li tout nèt, ou te fè tout moun sa yo philosophes pandye nan, pale osijè de la Lumières.

source: And this is kind of the whole movement where people, and authors, and poets, and philosophers, are starting to realize that, gee, maybe we don't need kings.
ht: Sa a se ti jan tout mouvman an kote moun, Et otè, Et poètes, Et philosophes, ap kòmanse pou reyalize sa, gee, petèt nou pa bezwen wa.

source: Maybe we don't need priests to tell us what it means to be good or bad.
ht: Petèt nou pa bezwen prèt pou di nou Kisa sa vle di gen ni an byen, ni an mal.

source: Maybe people could essentially rule themselves all of a sudden.
ht: Gen dwa moun te kapab esansyèlman dirije yo tout de yon soudaine.

source: And obviously, the biggest proof of the Enlightenment was the American Revolution.
ht: Et Evidamman, pi gwo pwèv de Lumières a te genyen revolisyon amerikèn lan.

source: That was kind of the first example of people rising up and saying, we don't need these kings anymore.
ht: Sa li te genyen jan de tankou premye moun hausse Apre sa, li di:-nou pa bezwen wa sa yo ankò.

source: We want to govern ourselves.
ht: Nou vle pou li gouvène tèt nou.

source: For the people, by the people.
ht: Pou pèp la, pou pèp la.

source: You also had kind of this philosophical movement going around.
ht: Nou yo tou gen jan de sa a filozofik mouvman sikile.

source: Now if you ask me my opinion of what the biggest thing was,
ht: Koulye a, si ou te mande m' opinyon mwen de sa a pi gwo bagay ki,

source: I think the people starving.
ht: Mwen panse ke moun kap mouri ak grangou.

source: You can never underestimate what people are willing to do when they're actually hungry.
ht: Ou pa janm ka sous-estimer ki moun ki dispoze pou yo fè lè yo gen aktyèlman grangou.

source: And, this is kind of more from the intellectual point of view.
ht: Et, sa se ti jan plis de intellectuelle pwen de vi a.

source: People said, oh there's Enlightenment movement here.
ht: Moun ki di yo: o la se Lumières mouvman isit la.

source: So this is the state of France.
ht: Se poutèt sa se eta frans.

source: They had a financial crisis.
ht: Yo te gen yon kriz finansye.

source: So a meeting was called, kind of an emergency meeting of the major groups of France to try to resolve some of these problems.
ht: Se konsa, yon reyinyon yo te rele, jan de yon reyinyon dijans pi gwo gwoup Auguste pou eseye rezoud kèk nan pwoblèm sa yo.

source: It's a fiscal crisis, people are starving, what do you do?
ht: Li se yon kriz fiskal la, moun ap faim, kisa ou pral fè?

source: So they called the Convocation of the Estates-General.
ht: Se konsa yo te rele konvokasyon de Estates-General.

source: Convocation of the Estates-General
ht: Konvokasyon de Estates-General

source: Which was a meeting of the three Estates of France.
ht: Ki te yon reyinyon de twa Estates frans.

source: Now what are the three Estates of France?
ht: Koulye a sa gen twa Estates Lafwans?

source: You can really just view them as the three major social classes of France.
ht: Ou kapab vwèman inikman wè yo tankou gwo twa sosyal klas de France.

source: The First Estate was the clergy.
ht: Immobilier premye a te genyen klèje la.

source: The Second Estate is the nobility.
ht: Dezyèm demenaje se rich.

source: And then the Third Estate is everyone else.
ht: Et puis Immobilier twazyèm a se tout moun.

source: Is everyone else..
ht: Se tout moun.

source: In a different color.
ht: Nan yon koulè diferan.

source: Everyone else.
ht: Tout lòt bagay.

source: This gives you a sense of how skewed the power structure.
ht: Sa a ba ou yon sans de kòman pas èstrikti pouvwa a.

source: Because people kind of grouped the power as OK: these are the three groups and maybe they can vote against each other.
ht: Paske, moun ki kalite regroupés pouvwa tankou pa pi mal: se sa yo rele twa gwoup Et, petèt yo ka vote kont ak lòt.
